#+TITLE: 周四, 2025-02-20
* TODO Taichi documentation
* TODO Drake documentation
* TODO Paper
:LOGBOOK:
CLOCK: [2025-01-13 周一 11:23]--[2025-01-13 周一 13:04] =>  1:41
:END:
** STARTED Foundation model RT-1
- State "STARTED"    from "DEFERRED"   [2025-01-15 周三 08:41]
- Note taken on [2025-01-14 周二 15:48] \\
  - FiLM
  - Token Learner
- Note taken on [2025-01-14 周二 11:34]
- State "DEFERRED"   from "STARTED"    [2025-01-13 周一 17:31]
:LOGBOOK:
CLOCK: [2025-01-15 周三 11:02]--[2025-01-16 周四 11:18] => 24:16
CLOCK: [2025-01-14 周二 16:33]--[2025-01-15 周三 11:02] => 18:29
CLOCK: [2025-01-14 周二 15:54]--[2025-01-14 周二 16:24] =>  0:30
CLOCK: [2025-01-14 周二 15:08]--[2025-01-14 周二 15:53] =>  0:45
CLOCK: [2025-01-14 周二 14:38]--[2025-01-14 周二 15:08] =>  0:30
CLOCK: [2025-01-13 周一 17:18]--[2025-01-13 周一 17:31] =>  0: 13
CLOCK: [2025-01-13 周一 16:36]--[2025-01-13 周一 17:06] =>  0:30
:END:
- State "STARTED"    from "TODO"       [2025-01-13 周一 16:36]
** TODO Foundation Model RT-2
** TODO Thinking with moving
** TODO OpenVLA paper
- Note taken on [2025-01-15 周三 09:15] \\
  - ~5GB model
  - 72GB GPU memory
  - fine-tuning 8xA100
  - Lora: 1xA100, >27GB
** TODO Foundation model Grounded Decoding
** TODO Diffusion Policy
** TODO Flow matching
** TODO shortest paths in graphs of convex sets
** TODO Language-based articulated asset generation
*** TODO CAGE https://3dlg-hcvc.github.io/cage/
*** TODO Articulate Anythin https://articulate-anything.github.io/
*** TODO URDFormer https://urdformer.github.io
*** TODO GraspXL https://eth-ait.github.io/graspxl/
** TODO PDDL
*** TODO PDDLStream https://ojs.aaai.org/index.php/ICAPS/article/view/6739
*** TODO https://en.wikipedia.org/wiki/Planning_Domain_Definition_Language
*** https://github.com/jan-dolejsi/vscode-pddl-samples/
** DONE Lagrange Mechanics for Dummies https://profoundphysics.com/lagrangian-mechanics-for-beginners/
- State "DONE"       from "STARTED"    [2025-01-22 周三 15:59]
:LOGBOOK:
CLOCK: [2025-01-21 周二 09:22]--[2025-01-21 周二 09:53] =>  0:31
CLOCK: [2025-01-20 周一 16:15]--[2025-01-21 周二 09:22] => 17:07
CLOCK: [2025-01-20 周一 15:44]--[2025-01-20 周一 16:15] =>  0:31
:END:
- State "STARTED"    from "TODO"       [2025-01-20 周一 15:44]
** TODO MiniCheetah [[E:/02-Papers/robotics/Actuators/MiniCheetah 10.1109@ICRA.2019.8793865.pdf]]
** TODO GCS
*** Motion planning around obstacles with convex optimization [[E:/02-Papers/robotics/Optimization/Motion planning around obstacles with convex optimization scirobotics.adf7843.pdf]]
*** TODO shortest paths in GCS [[E:/02-Papers/robotics/Optimization/Shortest Paths in Graphs of Convex Sets 2101.11565v5.pdf]]
** TODO Value-Based Deep RL Scales Predictably [[E:/02-Papers/deep reinforcement learning/Value-Based Deep RL Scales Predictably 2502.04327v1.pdf]]
** TODO VLM-R1 [[https://github.com/om-ai-lab/VLM-R1]]

- Note taken on [2025-02-18 周二 09:08] \\
  - R1 style large VLM
  - R1-V
    - *8*A100 30min*
** TODO RobotMover [[E:/02-Papers/deep reinforcement learning/RobotMOver 2502.05271v1.pdf]]
- Note taken on [2025-02-18 周二 11:21] \\
  - Dynamic Chain
  - better representation
  - learning based
  - large object manipulation (contact based planning)
  - cross-embodiment imitation
  - Simulation: *4096 environment 1*3080Ti*4h (BD Spot)*
  - PPO
** TODO ASAP [[E:/02-Papers/Robotics/ASAP 2502.01143v1.pdf]]
- Note taken on [2025-02-18 周二 10:56] \\
  - IsaacGym, IsaacSim,
  - Real2Sim2Real
  - Tram 捕捉3d运动,
  - SMPL retargeting to robot motion
  - training in simulation
  - Delta action model training
  - Policy Finetuning
  - C. Ronaldo *2hours@4090x2*
** TODO Dex-VLA [[E:/02-Papers/Robotics/Dex-VLA 2502.05855v1.pdf]]
- Note taken on [2025-02-18 周二 11:34] \\
  - Midea
  - Diffusion Expert for VLA
  - diffusion expert training
    - *100h*1*A6000*, 100h demonstration.
    - 1B parameter (from millions param.)
    - curriculum learning in 3 stages
  - VLA post-training
    - vla training: *8*h100*
    - reasoning capabilities!
** TODO DextrAH-RGB [[E:/02-Papers/Robotics/DextrAH-RGB 2412.01791v2.pdf]]
- Note taken on [2025-02-18 周二 11:52] \\
  - dexterous arm-hand manipulation
  - RL, simulation
  - fabric-guided policy
  - robust sim2real of e2e rgb based policy
  - student 53h*4*L40S(48GB)
  - teacher 62h*8*H100(80GB)
  - simulation, privileged learnging
** TODO SAM2ACT [[E:/02-Papers/Robotics/SAM2ACT 2501.18564v2.pdf]]
** TODO Competitive Programming with Large Reasoning Models [[E:/02-Papers/llm/Competitive Programming with Large Reasoning Models 2502.06807v1.pdf]]
- Note taken on [2025-02-18 周二 12:55] \\
  - 3d based robotics transformer
  - behavior cloning
  - image encoding
  - memory-based architectrure
  - *32/16/8 *NVIDIA H100/A100*
** TODO HumanPlus [[E:/02-Papers/Robotics/HumanPlus 2406.10454v1.pdf]]
- Note taken on [2025-02-20 周四 09:09] \\
  - MoCap
    - [[https://github.com/yohanshin/WHAM][WHAM]] , [[https://github.com/geopavlakos/hamer][HaMeR]]
  - Dataset: [[https://amass.is.tue.mpg.de/][AMASS]]
* TODO RVC reading
- State "DEFERRED"   from "STARTED"    [2025-01-24 周五 08:40]
- Note taken on [2025-01-23 周四 14:03] \\
  - soft contact is important for MuJoCo simulation, this necessitate the force control interface in the real physics of robot control
:LOGBOOK:
CLOCK: [2025-01-23 周四 14:01]--[2025-01-23 周四 14:35] =>  0:34
CLOCK: [2025-01-22 周三 16:09]--[2025-01-22 周三 17:08] =>  0:59
:END:
- State "STARTED"    from "TODO"       [2025-01-22 周三 16:07]
* TODO 13:55 OKR 季度评估
- State "DEFERRED"   from "STARTED"    [2025-01-24 周五 08:40]
- State "STARTED"    from "TODO"       [2025-01-23 周四 17:15]
* TODO 08:46 MuJoCo Computation Reading
- Note taken on [2025-01-24 周五 09:27] \\
  $n_Q$ > $n_V$ > number of actuation (underactuated)
:LOGBOOK:
CLOCK: [2025-01-27 周一 17:17]--[2025-01-27 周一 17:37] =>  0:20
CLOCK: [2025-01-27 周一 10:37]--[2025-01-27 周一 17:17] =>  6:40
CLOCK: [2025-01-27 周一 10:08]--[2025-01-27 周一 10:37] =>  0:29
CLOCK: [2025-01-27 周一 09:40]--[2025-01-27 周一 10:08] =>  0:28
CLOCK: [2025-01-24 周五 09:24]--[2025-01-24 周五 11:14] =>  1:50
CLOCK: [2025-01-24 周五 08:53]--[2025-01-24 周五 09:24] =>  0:31
:END:
* TODO update drl_101
* TODO read mujoco
* 09:08 deepseek slides improvement
** TODO graph improvment and embedding into ppt
:LOGBOOK:
CLOCK: [2025-02-20 周四 10:44]--[2025-02-21 周五 17:37] => 30:53
CLOCK: [2025-02-20 周四 10:19]--[2025-02-20 周四 10:44] =>  0:25
CLOCK: [2025-02-20 周四 09:51]--[2025-02-20 周四 10:19] =>  0:28
CLOCK: [2025-02-20 周四 09:21]--[2025-02-20 周四 09:51] =>  0:30
:END:
** TODO agenda for deployment, summarization
** TODO graph animation and slide optimization
* 16:31 AI应用周会
- 郭海冰
  - 代码生成:
  - 办公类:
  - 机器人:
    - 工业大模型
- 宏观规划(路径)+落地应用(1+1)
  - 多模态
  - 具身
  - 如何训练?
  - 视觉增强,离线编程的智能化,预测性维护
  - 具身训练
    - 工业机器人:简单的先实现;
    - 具身机器人
  - 算力, 模型?
    - 软件2.0;
  - 那鹏,工业机器人,结合业务,案例
- 冯工
  - 理解图纸,需要专家知识
